In [1]:
#importing pandas module
import pandas as pd

In [3]:
#Series
pd.Series([1,2,3])

0    1
1    2
2    3
dtype: int64

In [4]:
#DataFrames
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [5]:
d={"Name":['Aadi','Krishanu','soham','aishwarya'],"Age":[19,20,18,20]}
pd.DataFrame(d)

        Name  Age
0       Aadi   19
1   Krishanu   20
2      soham   18
3  aishwarya   20

In [6]:
#now see the difference between series and Dataframes
pd.Series(d)

Name    [Aadi, Krishanu, soham, aishwarya]
Age                       [19, 20, 18, 20]
dtype: object

In [17]:
#indexing series 
series=pd.Series(['kolkata','Chennai','Bengaluru','mumbai'])

In [18]:
series.index=['City1','City2','City3','City4']

In [19]:
print(series)

City1      kolkata
City2      Chennai
City3    Bengaluru
City4       mumbai
dtype: object

In [20]:
#indexing dataframes
dataset={"day":[1,2,3],"time":[10,11,12]}
myvar2=pd.DataFrame(dataset,index=["day1","day2","day3"])
print(myvar2)

      day  time
day1    1    10
day2    2    11
day3    3    12

In [24]:
#viewing datafiles
data=pd.read_csv("C:/Users/aadi1/downloads/nba.csv")

In [25]:
data.head() #returns the first five rows of the dataset

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
2,John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
4,Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

In [26]:
data.tail() #returns last five rows of the dataset

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
454,Raul Neto,Utah Jazz,25.0,PG,24.0,6-1,179.0,NaN,900000.0
455,Tibor Pleiss,Utah Jazz,21.0,C,26.0,7-3,256.0,NaN,2900000.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0
457,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [27]:
data.describe() #provides statistics on the data file

           Number         Age      Weight        Salary
count  457.000000  457.000000  457.000000  4.460000e+02
mean    17.678337   26.938731  221.522976  4.842684e+06
std     15.966090    4.404016   26.368343  5.229238e+06
min      0.000000   19.000000  161.000000  3.088800e+04
25%      5.000000   24.000000  200.000000  1.044792e+06
50%     13.000000   26.000000  220.000000  2.839073e+06
75%     25.000000   30.000000  240.000000  6.500000e+06
max     99.000000   40.000000  307.000000  2.500000e+07

In [36]:
data.dropna(inplace=False)#drops null values

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
0,Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
1,Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
3,R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
6,Jordan Mickey,Boston Celtics,55.0,PF,21.0,6-8,235.0,LSU,1170960.0
7,Kelly Olynyk,Boston Celtics,41.0,C,25.0,7-0,238.0,Gonzaga,2165160.0
...,...,...,...,...,...,...,...,...,...
449,Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0
451,Chris Johnson,Utah Jazz,23.0,SF,26.0,6-6,206.0,Dayton,981348.0
452,Trey Lyles,Utah Jazz,41.0,PF,20.0,6-10,234.0,Kentucky,2239800.0
453,Shelvin Mack,Utah Jazz,8.0,PG,26.0,6-3,203.0,Butler,2433333.0
456,Jeff Withey,Utah Jazz,24.0,C,26.0,7-0,231.0,Kansas,947276.0

In [39]:
desc=data["Name"].describe()

In [40]:
desc

count               364
unique              364
top       Avery Bradley
freq                  1
Name: Name, dtype: object

In [55]:
#retrieiving data from rows
data1=pd.read_csv("C:/Users/aadi1/downloads/nba.csv",index_col="Name")#mentioning the column from which rows are being accessed

first=data1.loc["Jae Crowder"]
second=data1.loc["Rodney Hood"]

print(first, "\n\n\n" , second)

Team        Boston Celtics
Number                99.0
Position                SF
Age                   25.0
Height                 6-6
Weight               235.0
College          Marquette
Salary           6796117.0
Name: Jae Crowder, dtype: object


 Team        Utah Jazz
Number            5.0
Position           SG
Age              23.0
Height            6-8
Weight          206.0
College          Duke
Salary      1348440.0
Name: Rodney Hood, dtype: object

In [45]:
rows=data1.loc[["Jae Crowder","Rodney Hood"]]

In [46]:
print(type(rows))

<class 'pandas.core.frame.DataFrame'>

In [47]:
rows

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
Rodney Hood,Utah Jazz,5.0,SG,23.0,6-8,206.0,Duke,1348440.0

In [51]:
rows.describe()#various operations can be performed here

          Number        Age      Weight        Salary
count   2.000000   2.000000    2.000000  2.000000e+00
mean   52.000000  24.000000  220.500000  4.072278e+06
std    66.468037   1.414214   20.506097  3.852089e+06
min     5.000000  23.000000  206.000000  1.348440e+06
25%    28.500000  23.500000  213.250000  2.710359e+06
50%    52.000000  24.000000  220.500000  4.072278e+06
75%    75.500000  24.500000  227.750000  5.434198e+06
max    99.000000  25.000000  235.000000  6.796117e+06